In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
iris = sns.load_dataset("iris")
titanic = sns.load_dataset("titanic")

# 1.Iris

### a

In [2]:
#1
iris.sepal_length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [3]:
iris.groupby(["species"]).describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [4]:
#2
Q1 = iris.quantile(.25)
Q3 = iris.quantile(.75)
IQR = Q3-Q1
lower_bounce = Q1- 1.5*(IQR)
upper_bounce = Q3 + 1.5*(IQR)
def del_outlines(r):
    return r[i] if (lower_bounce[i] < r[i]) & (upper_bounce[i] > r[1]) else 0

In [5]:
iris2 = iris
for i in ["sepal_length","sepal_width","petal_length","petal_width"]:
   iris2[i] = iris2.apply(del_outlines,axis=1)

In [6]:
iris2

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [7]:
iris2.groupby("species").agg(['mean','std'])

           sepal_length           sepal_width           petal_length  \
                   mean       std        mean       std         mean
species
setosa            5.006  0.352490       3.174  0.869860        1.462
versicolor        5.936  0.516171       2.730  0.491250        4.260
virginica         6.588  0.635880       2.974  0.322497        5.552

                     petal_width
                 std        mean       std
species
setosa      0.173664       0.246  0.105386
versicolor  0.469911       1.326  0.197753
virginica   0.551895       2.026  0.274650

# Titanic

In [8]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [9]:
#1
titanic["category1"] = titanic.apply(lambda r:"child"if r.age<20 else r.sex,axis=1)
titanic["category1"]

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887     child
888    female
889      male
890      male
Name: category1, Length: 891, dtype: object

In [10]:
#2
titanic.age = titanic.age.fillna(titanic.age.mean())

In [11]:
#3
a = titanic.groupby(["sex"]).mean()[["survived"]].T
a

sex         female      male
survived  0.742038  0.188908

In [12]:
b = titanic.groupby(["pclass"]).mean()[["survived"]].T
b

pclass          1         2         3
survived  0.62963  0.472826  0.242363

In [13]:
c = titanic.groupby(["embark_town"]).mean()[["survived"]].T
b

pclass          1         2         3
survived  0.62963  0.472826  0.242363

In [14]:
pd.concat([a,b,c],axis=1).T

             survived
female       0.742038
male         0.188908
1            0.629630
2            0.472826
3            0.242363
Cherbourg    0.553571
Queenstown   0.389610
Southampton  0.336957

In [15]:
#4
bins = [1,20,30,50,70,100]
labels = ["미성년자","청년","중년","장년","노년"]
titanic["age_cat"] = pd.cut(titanic.age, bins, labels=labels)
titanic.groupby("age_cat").mean()[["survived"]]

         survived
age_cat
미성년자     0.424242
청년       0.334152
중년       0.423237
장년       0.355932
노년       0.200000

In [16]:
#5
titanic["q_cut"] = pd.qcut(titanic.age,3,labels=["Q1","Q2","Q3"])
titanic["q_cut"]

0      Q1
1      Q3
2      Q2
3      Q3
4      Q3
       ..
886    Q2
887    Q1
888    Q2
889    Q2
890    Q3
Name: q_cut, Length: 891, dtype: category
Categories (3, object): ['Q1' < 'Q2' < 'Q3']

In [17]:
titanic_pivot = titanic.pivot_table(index=["q_cut","sex"])
titanic_pivot[["survived"]]

              survived
q_cut sex
Q1    female  0.713115
      male    0.206704
Q2    female  0.701031
      male    0.164251
Q3    female  0.821053
      male    0.198953

In [18]:
# 생존율
a = (titanic.groupby(["q_cut","sex"]).sum()/titanic.groupby(["q_cut","sex"]).count()).survived
a

q_cut  sex
Q1     female    0.713115
       male      0.206704
Q2     female    0.701031
       male      0.164251
Q3     female    0.821053
       male      0.198953
Name: survived, dtype: float64

In [19]:
b = titanic.groupby(["q_cut","sex"]).size()/titanic.groupby(["q_cut"]).size()
b

q_cut  sex
Q1     female    0.405316
       male      0.594684
Q2     female    0.319079
       male      0.680921
Q3     female    0.332168
       male      0.667832
dtype: float64

In [20]:
df1 = pd.DataFrame(a)
df2 = pd.DataFrame(b,columns=["male_female"])

pd.merge(df1, df2, how='outer',on=['q_cut',"sex"])

              survived  male_female
q_cut sex
Q1    female  0.713115     0.405316
      male    0.206704     0.594684
Q2    female  0.701031     0.319079
      male    0.164251     0.680921
Q3    female  0.821053     0.332168
      male    0.198953     0.667832

# MPG

In [21]:
mpg = sns.load_dataset('mpg')

In [22]:
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [23]:
mpg.displacement

0      307.0
1      350.0
2      318.0
3      304.0
4      302.0
       ...
393    140.0
394     97.0
395    135.0
396    120.0
397    119.0
Name: displacement, Length: 398, dtype: float64

In [24]:
# a
mpg["hp_per_cc"] = mpg.apply(lambda x:x["horsepower"]/x["displacement"],axis=1)
mpg["hp_per_cc"]

0      0.423453
1      0.471429
2      0.471698
3      0.493421
4      0.463576
         ...
393    0.614286
394    0.536082
395    0.622222
396    0.658333
397    0.689076
Name: hp_per_cc, Length: 398, dtype: float64

In [25]:
# b
mpg.name

0      chevrolet chevelle malibu
1              buick skylark 320
2             plymouth satellite
3                  amc rebel sst
4                    ford torino
                 ...
393              ford mustang gl
394                    vw pickup
395                dodge rampage
396                  ford ranger
397                   chevy s-10
Name: name, Length: 398, dtype: object

In [26]:
mpg["manufacturer"] = mpg.apply(lambda r:str(r["name"]).split()[0],axis=1)

In [27]:
mpg["model"] = mpg.apply(lambda r:' '.join(str(r["name"]).split()[1:]),axis=1)
mpg["model"]

0      chevelle malibu
1          skylark 320
2            satellite
3            rebel sst
4               torino
            ...
393         mustang gl
394             pickup
395            rampage
396             ranger
397               s-10
Name: model, Length: 398, dtype: object

In [28]:
del mpg["name"]

In [29]:
# c
mpg.groupby("cylinders").mean()[::-1][["mpg"]]

                 mpg
cylinders
8          14.963107
6          19.985714
5          27.366667
4          29.286765
3          20.550000

In [30]:
# d
mpg.groupby("origin").mean()[["hp_per_cc"]]

        hp_per_cc
origin
europe   0.740005
japan    0.789485
usa      0.512063

In [31]:
#e
mpg_manu = mpg.groupby(["manufacturer"]).mean()
mpg_manu

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,hp_per_cc
manufacturer,,,,,,,,
amc,18.246429,6.357143,250.178571,114.703704,3280.642857,15.264286,74.285714,0.454902
audi,26.714286,4.285714,111.857143,86.714286,2556.142857,15.942857,75.714286,0.779499
bmw,23.750000,4.000000,121.000000,111.500000,2417.000000,12.650000,73.500000,0.921488
buick,19.182353,6.470588,272.941176,136.411765,3553.352941,14.700000,76.117647,0.518085
cadillac,19.750000,8.000000,350.000000,152.500000,4140.000000,14.750000,77.500000,0.435714
capri,25.000000,4.000000,140.000000,92.000000,2572.000000,14.900000,76.000000,0.657143
chevroelt,16.000000,6.000000,250.000000,105.000000,3897.000000,18.500000,75.000000,0.420000
chevrolet,20.472093,6.139535,237.860465,112.930233,3276.023256,15.320930,75.511628,0.515856
chevy,18.000000,6.666667,258.666667,142.333333,3717.000000,15.466667,76.000000,0.584942
chrysler,17.266667,7.000000,330.166667,153.666667,3912.000000,13.300000,77.333333,0.470471
datsun,31.113043,4.260870,103.260870,83.826087,2242.217391,16.408696,76.869565,0.815750
dodge,22.060714,6.000000,223.125000,117.178571,3206.250000,14.460714,76.535714,0.582117
fiat,28.912500,4.000000,92.125000,73.375000,2143.125000,15.650000,74.250000,0.799070
ford,19.694118,6.078431,233.862745,112.229167,3301.215686,15.378431,75.490196,0.501533
hi,9.000000,8.000000,304.000000,193.000000,4732.000000,18.500000,70.000000,0.634868
honda,33.761538,4.000000,97.230769,67.846154,2023.384615,15.992308,78.923077,0.695736
maxda,26.050000,3.500000,78.000000,77.500000,2049.500000,14.350000,76.000000,1.020764
mazda,30.860000,3.700000,89.700000,77.700000,2272.200000,16.440000,79.300000,0.909519
mercedes,25.400000,5.000000,183.000000,77.000000,3530.000000,20.100000,79.000000,0.420765
mercedes-benz,23.250000,5.000000,157.000000,93.500000,3535.000000,19.250000,78.000000,0.586595
mercury,19.118182,6.545455,258.000000,119.818182,3428.545455,14.963636,76.090909,0.497982
nissan,36.000000,4.000000,120.000000,88.000000,2160.000000,14.500000,82.000000,0.733333
oldsmobile,21.100000,7.200000,276.600000,122.000000,3575.900000,16.020000,77.200000,0.453010
opel,25.750000,4.000000,111.250000,81.000000,2200.250000,15.225000,73.500000,0.731203
peugeot,23.687500,4.250000,124.250000,88.000000,2972.750000,19.550000,75.250000,0.719441
plymouth,21.703226,6.000000,222.741935,111.419355,3218.967742,14.851613,75.096774,0.532312
pontiac,20.012500,6.250000,282.625000,136.937500,3655.312500,14.081250,75.500000,0.508768
renault,32.880000,4.000000,92.200000,70.000000,2074.200000,17.000000,77.200000,0.758236
saab,23.900000,4.000000,116.750000,108.750000,2625.250000,15.175000,74.000000,0.930845
subaru,30.525000,4.000000,99.750000,73.500000,2146.500000,16.925000,78.000000,0.733319
toyota,28.372000,4.240000,111.320000,83.440000,2301.160000,16.100000,76.520000,0.758033
toyouta,23.000000,4.000000,120.000000,97.000000,2506.000000,14.500000,72.000000,0.808333
triumph,35.000000,4.000000,122.000000,88.000000,2500.000000,15.100000,80.000000,0.721311
vokswagen,29.800000,4.000000,89.000000,62.000000,1845.000000,15.300000,80.000000,0.696629
volkswagen,29.106667,4.000000,96.533333,65.600000,2040.466667,16.980000,75.400000,0.683160
volvo,21.116667,4.666667,133.500000,104.166667,3032.666667,15.566667,75.833333,0.789464
vw,39.016667,4.000000,92.333333,60.833333,2092.666667,18.816667,79.500000,0.658965

In [32]:
# 이게 답이고 아래는 푼던 다른 방법입니다
mpg_manu[mpg.manufacturer.value_counts()>4].sort_values(by="mpg")[:-6:-1][["mpg"]]

                    mpg
manufacturer
vw            39.016667
honda         33.761538
renault       32.880000
datsun        31.113043
mazda         30.860000

In [33]:
#e practice
a = mpg.manufacturer.value_counts()[mpg.manufacturer.value_counts()>4]
mpg_manu_count = pd.DataFrame(a)
mpg_manu_count

            manufacturer
ford                  51
chevrolet             43
plymouth              31
dodge                 28
amc                   28
toyota                25
datsun                23
buick                 17
pontiac               16
volkswagen            15
honda                 13
mercury               11
oldsmobile            10
mazda                 10
fiat                   8
peugeot                8
audi                   7
vw                     6
volvo                  6
chrysler               6
renault                5

In [34]:
mpg_manu_count.join(mpg_manu, how='inner').sort_values(by="mpg")[:-6:-1][["mpg"]]

               mpg
vw       39.016667
honda    33.761538
renault  32.880000
datsun   31.113043
mazda    30.860000